---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.DuctSizeSettings
source: html/71f9837e-1f88-83d6-23a9-3f4f4006f8d3.htm
---
# DuctSizeSettings Methods

Inserts a new MEPSize in to the duct size settings. The duct shape determines the location of the new size in the size table.